{"backend": "tensorflow", "keras_version": "2.1.3", "config": [{"config": {"data_format": "channels_last", "trainable": true, "batch_input_shape": [null, 32, 32, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "padding": "same", "strides": [1, 1], "activation": "linear", "name": "conv2d_1", "use_bias": true, "dtype": "float32", "filters": 32, "kernel_regularizer": null, "kernel_constraint": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "trainable": true, "name": "max_pooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_1", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 512, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense_2", "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 10, "bias_regularizer": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}], "class_name": "Sequential"}